ExchangePlans/МобильныйОбмен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<ExchangePlan>
		<Properties>
			<Name>МобильныйОбмен</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольныйХеш</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ExchangePlans/МобильныйОбмен/Ext/ManagerModule.bsl
&НаСервере
Функция Войти(Емейл, ПарольныйХеш) Экспорт
	Контрагент = ПроверитьДанныеВхода(Емейл, ПарольныйХеш);
	Если Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
		Возврат ПланыОбмена.МобильныйОбмен.ПустаяСсылка();
	КонецЕсли;	        
	
	Возврат СоздатьНовыйУзелМобильногоПриложения(Контрагент);	
КонецФункции	   

&НаСервере
Функция ПроверитьДанныеВхода(Емейл, ПарольныйХеш)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК КонтрагентСсылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Email = &Емейл
		|	И Контрагенты.ПарольныйХеш = &ПарольныйХеш";
	
	Запрос.УстановитьПараметр("Емейл", Емейл);
	Запрос.УстановитьПараметр("ПарольныйХеш", ПарольныйХеш);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Выборка.КонтрагентСсылка;
КонецФункции        

&НаСервере
Функция СоздатьНовыйУзелМобильногоПриложения(Контрагент)
	НовыйУзел = ПланыОбмена.МобильныйОбмен.СоздатьУзел();  
	НовыйУзел.УстановитьНовыйКод();
	НовыйУзел.Наименование = НовыйУзел.Код;
	НовыйУзел.Контрагент = Контрагент;
	НовыйУзел.Записать();
	Возврат НовыйУзел.Ссылка;
КонецФункции 



&НаСервере
Функция Выйти(Узел) Экспорт
	УдалитьУзелМобильногоПриложения(Узел);	
КонецФункции

&НаСервере
Функция УдалитьУзелМобильногоПриложения(Узел)
	Узел.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
КонецФункции
